---
kind: method
id: M:Autodesk.Revit.DB.FormatValueOptions.Dispose
source: html/b8787d48-ce27-5a99-508d-69c7d46ab063.htm
---
# Autodesk.Revit.DB.FormatValueOptions.Dispose Method

Releases all resources used by the FormatValueOptions

## Syntax (C#)
```csharp
public void Dispose()
```